app/controllers/tickets_controller.rb

  def create
    ticket = current_account.tickets.create(ticket_params)
---
INSERT INTO "tickets" ("account_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["account_id", 1], ["created_at", "2015-12-05 00:40:27.789474"], ["updated_at", "2015-12-05 00:40:27.789474"]]

  def destroy
    ticket.destroy!
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]